-- Для выполнения следующих команд необходимо подключиться к БД eatfit:
-- # \c eatfit ef_admin

-- TRUNCATE ef.city CASCADE;
INSERT INTO ef.city(name) VALUES
	('Москва'),
	('Санкт-Петербург'),
	('Нижний Новгород'),
	('Ярославль'),
	('Екатеринбург'),
	('Новосибирск');

-- TRUNCATE ef.address CASCADE;
INSERT INTO ef.address(cityid, street, building, entrance, floor, flat) VALUES
	(1, 'Ленина', '5', NULL, NULL, 22),
	(1, 'Пушкина', '6', '1', NULL, 15),
	(1, 'Ратная', '14', '3', '8', 48),
	(1, 'Аргуновская', '2', NULL, '8', NULL),
	(2, 'Ленина', '5 литера А', NULL, NULL, 24),
	(2, 'Пушкина', '6 литера Б', '3', NULL, 17),
	(2, 'Свободы', '15', '4', '9', 150),
	(3, 'Ленина', '7', NULL, NULL, 26),
	(3, 'Пушкина', '9', '5', NULL, 19),
	(4, 'Ленина', '12', NULL, NULL, 455),
	(4, 'Пушкина', '1', '10', NULL, 6),
	(5, 'Ленина', '18 к 1', NULL, NULL, 53),
	(6, 'Пушкина', '17', '9', NULL, 88);

-- TRUNCATE ef.customer CASCADE;
INSERT INTO ef.customer(firstname, lastname, phone, addressid, cityid) VALUES
	('Петр', 'Иванов', '+74817501172', NULL, 1),
	('Сергей', 'Кузнецов', '+74257821203', 2, 1),
	('Иван', 'Кожемякин', '+79721755429', NULL, 1),
	('Ирина', 'Громова', '+78768421742', NULL, 1),
	('Анна', 'Свиридова', '+77978241750', 5, 2),
	('Алексей', 'Нарышкин', '+74654812128', 6, 2),
	('Ксения', 'Темникова', '+79768418641', NULL, 2),
	('Игорь', 'Завьялов', '+71354168472', NULL, 3),
	('Илья', 'Сидоров', '+70212455644', NULL, 4),
	('Маргарита', 'Светлова', '+70214178774', 10, 4),
	('Евгения', 'Лапина', '+78946121487', NULL, 5),
	('Анатолий', 'Кудюхов', '+71325487871', 13, 6);